#+TITLE: Emacs Starter Kit
#+SEQ_TODO: PROPOSED TODO STARTED | DONE DEFERRED REJECTED
#+OPTIONS: H:2 num:nil toc:t
#+STARTUP: oddeven

*** ELPA (Emacs Lisp Package Manager)
Load up [[http://tromey.com/elpa/][ELPA]], the Emacs Lisp package manager.

#+srcname: starter-kit-elpa
#+begin_src emacs-lisp 
  (require 'package)
  (setq package-archives
            '(
          ("org"         . "http://orgmode.org/elpa/")
              ("gnu"         . "http://elpa.gnu.org/packages/")
          ("melpa"   . "http://melpa.milkbox.net/packages/")
          ("marmalade" . "http://marmalade-repo.org/packages/")))
  

;;; Add support to package.el for pre-filtering available packages
(defvar package-filter-function nil
  "Optional predicate function used to internally filter packages used by package.el.

The function is called with the arguments PACKAGE VERSION ARCHIVE, where
PACKAGE is a symbol, VERSION is a vector as produced by `version-to-list', and
ARCHIVE is the string name of the package archive.")

  
(defadvice package--add-to-archive-contents
  
  (around filter-packages (package archive) activate)
  
  "Add filtering of available packages using `package-filter-function', if non-nil."
  
  (when (or (null package-filter-function)
  
(funcall package-filter-function
	 (car package)
	 (funcall (if (fboundp 'package-desc-version)
		      'package--ac-desc-version
		    'package-desc-vers)
		  (cdr package))
	 archive))
    ad-do-it))

(defvar melpa-exclude-packages
      '(slime magit)
  "Don't install Melpa versions of these packages.")

;; Don't take Melpa versions of certain packages
(setq package-filter-function
      (lambda (package version archive)
        (and
         (not (memq package '(eieio)))
         (or (not (string-equal archive "melpa"))
             (not (memq package melpa-exclude-packages))))))

  (package-initialize)
  (starter-kit-load "starter-kit-elpa.org")
#+end_src

#+results: starter-kit-elpa
: loaded starter-kit-elpa.el

